hello = 'Вы идете домой. Вот ваш дом, ваш подъезд. \
    Достаете из кармана ключ, прижимаете к домофону таблетку, \
    тот узнает вас, пикает и открывает дверь. Вы заходите внутрь. \
    Секунд пять стоите в недоумении. Это не ваш подъезд. \
    Вы поворачиваетесь, чтобы выйти, но вместо привычной \
    кнопки возле двери висит такой же домофон. Вы попробовали \
    позвонить в какую-то квартиру, но, видимо, здесь так нельзя \
    – надо ввести какой-то код. Кода вы не знаете.'
pod = 'Подъезд незнакомый. Лифта нет, только лестница вверх. \
    Почти все квартиры опечатаны. Только одна отрыта - №6. Введите \
    «В квартиру №6» или «На второй этаж»'
et2 = 'Вы на втором этаже. Перед вами лестница. На этом этаже \
    тоже полно опечатанных квартир, но есть две открытые  \
    - №12 и №13. Введите «В квартиру №12», «В квартиру №13», \
    «В подъезд» или «На третий этаж»'
et3 = 'Вы на третьем этаже. Перед вами две открытые квартиры \
    - №21 и №27, и чердак. Ключа от чердака у вас нет, поэтому \
    пройти туда не получится. Введите «В квартиру №21», \
    «В квартиру №27» или «На второй этаж».'
et3_withkey = 'Вы на третьем этаже. Перед вами две открытые \
    квартиры - №21 и №27, и чердак, ключ от которого вы нашли \
    в квартире №27. Введите «В квартиру №21», «В квартиру №27», \
    «На чердак» или «На второй этаж».'
kv6 = 'На двери квартиры №6 скопилась пыль. Вы тяните за ручку, \
    дверь поддается и открывается. В прихожей нет ничего из мебели, \
    кроме какого-то стула без ножки. Рядом со стулом лежит что-то \
    небольшое. Вы поднимаете это – это фонарик. Такая штучка вам \
    еще пригодится, кладете его в карман. Перед вами дверной проем \
    без двери и проход в гостиную. Введите «В гостиную» или «В подъезд»'
kv6_withlight = 'На двери квартиры №6 скопилась пыль. Вы тяните за \
    ручку, дверь поддается и открывается. В прихожей нет ничего из \
    мебели, кроме какого-то стула без ножки. Перед вами дверной проем \
    без двери и проход в гостиную. Введите «В гостиную» или «В подъезд»'
kv6_glub = 'Вы проходите в гостиную. Тут уже заметно больше мебели: \
    около дальней стены стоит старенький диван, стол перед ним, кресло,\
    еще два стула, нараспашку открыто окно. Вы не сразу замечаете \
    дыру в стене над диваном. Вы подходите к ней и светите фонариком \
    внутрь. Первые несколько секунд вы ничего толком не видите, \
    но потом понимаете, что дюжина желтых огней – не что иное, \
    как глаза. И их хозяева (или хозяин) явно против вашего присутствия. \
    Неизвестно что резко дергается и прыгает. Земля уходит из-под \
    ног. Последнее, что вы видите – эти самые 12 глаз.'
kv6_glub_withknife = 'Вы проходите в гостиную. Тут уже заметно больше \
    мебели: около дальней стены стоит старенький диван, стол перед ним, \
    кресло, еще два стула, нараспашку открыто окно. Вы не сразу \
    замечаете дыру в стене над диваном. Вы подходите к ней и светите \
    фонариком внутрь, держа нож наготове. Сначала вы ничего не видите \
    внутри, но потом из глубины дыры словно всплыли 12 желтых, моргающих \
    вразнобой глаз. Вы на автомате выставляете перед собой нож, как раз \
    в тот момент, когда желтоглазая тварь выпрыгнула из дыры. Наткнувшись \
    на острие, она отскочила обратно, при чем, что странно, абсолютно \
    бесшумно. Кажется, пора уходить.'
kv12 = 'Вы входите в квартиру №12. Тут нет света, но лампа из коридора \
    еще освещает помещение. На полу лежит что-то блестящее. Вы поднимаете \
    это. Это нож. Перед вами темный дверной проем. Введите «В проем» \
    или «На второй этаж»'
kv12_withknife = 'Вы входите в квартиру №12. Тут нет света, но лампа из коридора \
    еще освещает помещение. Перед вами темный дверной проем. Введите «В проем» \
    или «На второй этаж»'
kv12_glub = 'Вы прошли в дверной проем. Телефон наотрез отказался включаться,\
    так что фонаря у вас фактически нет. Вы пытаетесь подвинуться наощупь, \
    пока глаза привыкают к темноте. Вдруг на другом конце комнаты \
    загорается слабый огонек, немного освещающий окружающую обстановку. \
    Вы подходите, посмотреть, что же это такое. Выглядит как желтый \
    стеклянный шарик из тех, что кладут в аквариумы. Вы пытаетесь его \
    взять. Это был глаз. Оскорбленный житель квартиры лязгнул зубами. \
    Лучше бы вы все-таки поискали фонарик, прежде чем входить.'
kv12_glub_withlight = 'Вы прошли в дверной проем. Телефон наотрез отказался \
    включаться, но у вас есть фонарь. Вы включаете его, освещаете комнату. \
    Кучи  старой и в основном поломанной мебели. Посреди комнаты словно \
    протоптана тропинка к дальней стене. Вы светите на конец этой тропинки.\
    Там лежит огромная черная масса из какого-то непонятного материала. Вы \
    решаете подойти ближе и посмотреть, что это, но потом замечаете еле \
    заметное движение. Вы смотрите на нее еще пару секунд. Да. Она дышит. \
    Кажется, пора уходить.'
kv13 = 'Вы вошли в тринадцатую квартиру. Несчастливое число. Почти сразу \
    дверь за вами захлопывается. Безо всяких церемоний из вентиляции друг за \
    другом вылезают и двенадцатиглазый, и черная масса со стеклянным глазом, \
    и грибной. Это всё. Даже дверь не открывается.'
kv21 = 'Вы открываете дверь квартиры №21.  В прихожей совсем пусто – только \
    пыль на полу. Перед вами дверной проем, ведущий в какую-то комнату. \
    Введите «В комнату» или «На третий этаж»'
kv21_glub = 'Вы прошли в комнату. Тут достаточно светло из-за \
    не зашторенного окна. Какое-то кресло,  какой-то  столик. Все на вид\
    обычно. Только приглядевшись, вы обнаруживаете маленькие грибочки, \
    растущие чуть ли не из всего.  Они похожи на опята – облепили \
    низенький столик как пень. При ближайшем рассмотрении оказалось, \
    что на стенах тоже растут грибы, но уже больше похожие на древесные. \
    Чем же они питаются – стены-то далеко не деревянные, к тому же тонкие. \
    Пока вы рассматриваете грибы, кресло чуть дрогнуло. Вы быстро обернулись. \
    Кресло быстро разворачивалось. И спинка, подлокотники – все это было \
    шляпками больших грибов, растущих на теле какого-то существа, совсем \
    маленького, по сравнению со своими паразитами. Этим грибам вряд ли \
    хватает его – а вот и новый человек!  Грибной вытянул вперед два \
    особенно длинных гриба – шляпки в секунду сложились пополам и обросли \
    шипами. Убегать уже поздно.'
kv21_glub_withknife = 'Вы прошли в комнату, держа нож наготове. Тут \
    достаточно светло из-за не зашторенного окна. Какое-то кресло,  \
    какой-то  столик. Все на вид обычно. Только приглядевшись, вы \
    обнаруживаете маленькие грибочки, растущие чуть ли не из всего.  Они \
    похожи на опята – облепили низенький столик как пень. При ближайшем \
    рассмотрении оказалось, что на стенах тоже растут грибы, но уже \
    больше похожие на древесные. Чем же они питаются – стены-то далеко \
    не деревянные, к тому же тонкие. Пока вы рассматриваете грибы, кресло \
    чуть дрогнуло. Вы быстро обернулись. Кресло быстро разворачивалось. \
    И спинка, подлокотники – все это было шляпками больших грибов, \
    растущих на теле какого-то существа, совсем маленького, по сравнению \
    со своими паразитами. Вряд ли эта штука сыта и дружелюбна. Грибы быстро \
    преобразуют шляпки в заостренные лезвия и вытягивают ножки к вам. \
    Вы инстинктивно выставляете вперед нож. Три шляпки разлетелись по \
    комнате, ножки убрались ближе к грибнице, существо подпрыгнуло и \
    понеслось с другую комнату. Кажется, пора уходить.'
kv27 = 'Вы прошли в квартиру №27. В прихожей темно и пыльно, но висит лампа \
    – вы находите выключатель и, без особой надежды, нажимаете. \
    На удивление, он до сих пор работает и свет включается. \
    На полу сразу же обнаруживается что-то блестящее. Вы подняли \
    это – блестящий предмет оказался связкой ключей. Кольцо каждого \
    было намазано корректором, поверх которого было что-то написано, \
    однако почти все надписи смазаны. Лишь на одном ключе надпись \
    сохранила качество. Согласно ей, это был ключ от чердака. \
    Вы идете по коридору. Обе комнаты завалены какой-то мебелью, но \
    проход на кухню чист. Введите «На кухню» или «На третий этаж»'
kv27_whithkey = 'Вы прошли в квартиру №27. Лампа до сих пор горит\
    Вы идете по коридору. Обе комнаты завалены какой-то мебелью, но \
    проход на кухню чист. Введите «На кухню» или «На третий этаж»'
kv27_glub = 'Вы прошли на кухню. Лампы здесь нет, но свет из окна \
    прекрасно ее заменяет. Такое впечатление, что квартиру покидали в \
    спешке – в пыльной раковине еще осталась какая-то посуда, на столе \
    лежала тряпка и то, что когда-то, возможно, было хлебом или чем-то \
    подобным. Стул был опрокинут. Один холодильник выглядит новеньким и \
    свежим. Вы из интереса открываете дверцу. Лампочка включается, озаряя \
    содержимое слабым теплым светом. Молоко в бутылках, две кастрюли: \
    большая и поменьше, начатая колбаса, вопреки всему не заветревшаяся, \
    большой кусок сыра, свежий и абсолютно свободный от плесени, гнили и \
    другой атрибутики дорогих заморских сыров. Выглядит, как обычный \
    холодильник в обычном доме. Неужели кто-то регулярно заменяет здесь \
    еду? Но кто? И зачем? А меж тем крышка большой кастрюли дрогнула. \
    Потом еще раз. А потом из-под нее показалось щупальце, за ним еще и \
    еще, и буквально через мгновение фиолетовый осьминог, безумно хлопая \
    своим единственным глазом, расположенным посередине головы, полностью \
    вылез из своего временного пристанища, накрыв своим туловищем и \
    непопорченный сыр, и начатую колбасу. Вы оборачиваетесь в поисках \
    чего-нибудь острого, но на столе только тарелка и хлеб. Одноглазый \
    воспользовался моментом и прыгнул на возмутителя спокойствия. Лежа \
    на полу, вы осознаете, что тарелку можно было разбить, но уже поздно. '
kv27_glub_withknife = 'Вы прошли на кухню. Лампы здесь нет, но свет из \
    окна прекрасно ее заменяет. Такое впечатление, что квартиру покидали \
    в спешке – в пыльной раковине еще осталась какая-то посуда, на столе \
    лежала тряпка и то, что когда-то, возможно, было хлебом или чем-то \
    подобным. Стул был опрокинут. Один холодильник выглядит новеньким \
    и свежим. Вы из интереса открываете дверцу. Лампочка включается, \
    озаряя содержимое слабым теплым светом. Молоко в бутылках, две \
    кастрюли: большая и поменьше, начатая колбаса, вопреки всему не \
    заветревшаяся, большой кусок сыра, свежий и абсолютно свободный \
    от плесени, гнили и другой атрибутики дорогих заморских сыров. \
    Выглядит, как обычный холодильник в обычном доме. Неужели кто-то \
    регулярно заменяет здесь еду? Но кто? И зачем? А меж тем крышка \
    большой кастрюли дрогнула. Потом еще раз. А потом из-под нее \
    показалось щупальце. Вы полоснули ножом по отростку, его обладатель \
    злобно пискнул и втянул раненную конечность обратно. Вы аккуратно \
    закрыли холодильник. Кажется, пора уходить.'
cherdak = 'Вы пробуете ключ в скважине. Он легко проворачивается. \
    Вы толкаете дверь и та, со скрипом, открывается. Тут темно, а \
    фонаря у вас нет. Но тем не менее, вы продвигаетесь вперед. Из \
    темноты доносится тихий рык. Глаза немного привыкли к темноте, \
    потому различают у дальней стены три слабо поблескивающих в темноте \
    глаза. Последняя ваша мысль – где-то вы такое уже видели.'
cherdak_withkod = 'Да вы тут всех перебили, код нашли, что вам \
    еще надо?'
cherdak_withlight = 'Вы пробуете ключ в скважине. Он легко проворачивается. \
    Вы толкаете дверь и та, со скрипом, открывается. Тут темно, вы включаете\
    фонарь. Черное нечто с тремя желтыми, как у той твари из шестой \
    квартиры, глазами, сидит, поджав под себя шесть своих длинных лап, как \
    кот. Завидев вас, тварь поднимается. Своим горбом она утыкается едва ли \
    не в потолок. Широкая морда выглядит далеко не так устрашающе, \
    как могла бы, будь ее обладатель пониже, но его это совершенно не \
    смущает – он настроен уничтожить возмутителя своего спокойствия, \
    во что бы то ни стало. Он рычит, отклоняется на лапах назад, \
    не понимая, что на чердаке маловато места для прыжка. \
    Вы хотите убежать, но обнаруживаете, что дверь захлопнулась. \
    Проклятый старый дом! Почему все так и ополчилось на случайного \
    попаданца? Желтоглазый прыгнул.\
    Эх, и даже табличку «YOU DIED» не высветят.'
cherdak_withkeyknifelight = 'Вы пробуете ключ в скважине. Он легко \
    проворачивается. Вы толкаете дверь и та, со скрипом, открывается. \
    Тут темно, вы включаете фонарь. Черное нечто с тремя желтыми, как у \
    той твари из шестой квартиры, глазами, сидит, поджав под себя шесть \
    своих длинных лап, как кот. Завидев вас, тварь поднимается. Своим \
    горбом она утыкается едва ли не в потолок, нож в ваших руках ее \
    совершенно не пугает. Широкая морда выглядит далеко не так устрашающе, \
    как могла бы, будь ее обладатель пониже, но его это совершенно не \
    смущает – он настроен уничтожить возмутителя своего спокойствия, во \
    что бы то ни стало. Он рычит, отклоняется на лапах назад, не понимая, \
    что на чердаке маловато места для прыжка. В этот момент вы со всей \
    силы бьете ножом по одной из шести лап. Желтоглазый, совершенно не \
    ожидавший такого поворота, подскакивает с визгом. Вы бьете по второй, \
    сбитая с толку тварь вновь подпрыгивает и жмется к дальней стене. Но, \
    к сожалению, пол не рассчитан на то, чтобы на нем прыгал тонконогий \
    тяжеловес. Раздается тихий треск, с каждой секундой делающийся все \
    громче. Вы отступаете шагов на пять назад, и пол в той части помещения \
    буквально обваливается вместе с трехглазым. Вы светите фонариком на пол. \
    Корме мусора, здесь нет ничего полезного. Вы собрались было уходить, но \
    тут ваш взгляд зацепился за что-то, и вы обернулись. В углу одиноко\
    лежала тетрадка. Вы подошли и открыли ее. Почти все страницы пусты, \
    но на двух первых есть какой-то текст. Вы светите фонариком и читаете. \
    Раз в месяц код внутреннего домофона должен был меняться и рассылаться \
    жильцам. Эдакая защита от бомжей. Последний код – 425483, был установлен \
    12 сентября 1998 года. Хоть бы он работал, боже.'
dvor = 'Вы спускаетесь на первый этаж, подходите к домофону, набираете на нем \
    код, подъезд радостно пикает и наконец выпускает вас. На улице уже темно \
    Телефон в кармане тихонько вибрирует, словно и не выключался никогда, \
    гаденыш эдакий. Карта показывает, что вы где-то на окраине города. По \
    крайней мере теперь есть, куда идти. Вы идете домой, оставив позади \
    проклятый старый дом.'
# Выше - переменные с текстами. Вывела их отдельно,
# дабы никому не путать мозг
knife = 0
light = 0
key = 0
kod = 0
print(hello)
step = 'В подъезд'
while step == 'В подъезд':
    print(pod)
    step = input()
    while step != 'В квартиру №6' and step != 'На второй этаж':
        print('В квартиру №6 или На второй этаж')
        step = input()
    while step == 'В квартиру №6':
        if light == 0:
            print(kv6)
            light = 1
        elif light == 1:
            print(kv6_withlight)
        step = input()
        while step != 'В подъезд' and step != 'В гостинную':
            print('В подъезд или В гостинную')
            step = input()
        if step == 'В гостинную':
            if knife == 0:
                print(kv6_glub)
            elif knife == 1:
                print(kv6_glub_withknife)
                step = 'В подъезд'
    while step == 'На второй этаж':
        print(et2)
        knife = 1
        step = input()
        while step != 'В квартиру №12' and step != 'В квартиру №13' and \
                step != 'На третий этаж':
            print('В квартиру №12, В квартиру №13 или На третий этаж')
            step = input()
        while step == 'В квартиру №12':
            print(kv12)
            step = input()
            while step != 'На второй этаж' and step != 'В проем':
                print('На второй этаж или В проем')
                step = input()
            if step == 'В проем':
                if light == 0:
                    print(kv12_glub)
                elif light == 1:
                    print(kv12_glub_withlight)
                    step = 'На второй этаж'
        if step == 'В квартиру №13':
            print(kv13)
        while step == 'На третий этаж':
            if key == 0:
                print(et3)
                step = input()
                while step != 'В квартиру №21' and step != 'В квартиру №27':
                    print('В квартиру №21 или В квартиру №27')
                    step = input()
            elif key == 1:
                print(et3_withkey)
                while step != 'В квартиру №21' and step != 'В квартиру №27' and \
                        step != 'На чердак':
                    print('В квартиру №21, В квартиру №27 или На чердак')
                    step = input()
            while step == 'В квартиру №21':
                print(kv21)
                step = input()
                while step != 'В комнату' and step != 'На третий этаж':
                    print('В комнату или На третий этаж')
                    step = input()
                if step == 'В комнату':
                    if knife == 0:
                        print(kv21_glub)
                    elif knife == 1:
                        print(kv21_glub_withknife)
                        step = 'На третий этаж'
            while step == 'В квартиру №27':
                if key == 0:
                    print(kv27)
                elif key == 1:
                    print(kv27_whithkey)
                key = 1
                step = input()
                while step != 'На кухню' and step != 'На третий этаж':
                    print('На кухню или На третий этаж')
                    step = input()
                if step == 'На кухню':
                    if knife != 1:
                        print(kv27_glub)
                    elif knife == 1:
                        print(kv27_glub_withknife)
                        step = 'На третий этаж'
            while step == 'На чердак':
                if kod == 1:
                    print(cherdak_withkod)
                if key == 1 and knife == 1 and light == 1:
                    print(cherdak_withkeyknifelight)
                    print(dvor)
                elif light == 1:
                    print(cherdak_withlight)
                else: 
                    print(cherdak)
print('Пара-пара-пам. Всё!')